/**
 * 常量管理者
 * @author maodun
 */
function ConstMgr() {}

/**
 * 中文
 */
ConstMgr.chinese = {
	/**
	 * 数字
	 */
	nums: {
		'0': '零', '1': '壹', '2': '贰', '3': '叁', '4': '肆',
		'5': '伍', '6': '陆', '7': '柒', '8': '捌', '9': '玖',
		'10': '拾', '11': '佰', '12': '仟', '13': '万', '14': '亿',
		'.': '点', '-': '负'
	},
	/**
	 * 星期
	 */
	week: {0: '日', 1: '一', 2: '二', 3: '三', 4: '四', 5: '五', 6: '六'},
	/**
	 * 城市
	 */
	citys: {
		11: '北京', 12: '天津', 13: '河北', 14: '山西', 15: '内蒙古',
		21: '辽宁', 22: '吉林', 23: '黑龙江', 31: '上海', 32: '江苏',
		33: '浙江', 34: '安徽', 35: '福建', 36: '江西', 37: '山东',
		41: '河南', 42: '湖北', 43: '湖南', 44: '广东', 45: '广西',
		46: '海南', 50: '重庆', 51: '四川', 52: '贵州', 53: '云南',
		54: '西藏', 61: '陕西', 62: '甘肃', 63: '青海', 64: '宁夏',
		65: '新疆', 71: '台湾', 81: '香港', 82: '澳门', 91: '国外'
	}
};

/**
 * 键码集
 */
ConstMgr.keyCodes = {
	esc: 27,
	enter: 13
};